asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-32-example-02.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
		xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
		xmlns:pm="http://standards.ieee.org/downloads/11073/11073-10207-2017/participant"
		xmlns:msg="http://standards.ieee.org/downloads/11073/11073-10207-2017/message"
		xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:hm="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.2">
	<s12:Header>
		<wsa:Action>urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1.2</wsa:Action>
		<wsa:MessageID>urn:uuid:6df65470-5b50-11ed-9b6a-0242ac120000</wsa:MessageID>
		<wsa:To>https://127.0.0.1:6464/EventSink/NotifyTo/56db24f3-b210-40d6-9579-6dd750b1a01a</wsa:To>
	</s12:Header>
	<s12:Body>
		<hm:ChangeSequenceReport>
			<hm:ChangeSequence SequenceId="urn:uuid:68c97947-6f7e-4122-82ed-971fbf6085af" InstanceId="0">
				<hm:HistoricMdib Time="1667464770000">
					<msg:GetMdibResponse SequenceId="urn:uuid:68c97947-6f7e-4122-82ed-971fbf6085af" InstanceId="0">
						<msg:Mdib SequenceId="urn:uuid:68c97947-6f7e-4122-82ed-971fbf6085af">
							<pm:MdDescription>
								<!-- Descriptive part goes here -->
							</pm:MdDescription>
							<pm:MdState>
								<!-- State part goes here -->
							</pm:MdState>
						</msg:Mdib>
					</msg:GetMdibResponse>
				</hm:HistoricMdib>
				<hm:HistoricReport Time="1667464771000">
					<msg:EpisodicMetricReport SequenceId="urn:uuid:68c97947-6f7e-4122-82ed-971fbf6085af" InstanceId="0" MdibVersion="1">
						<!-- Report data -->
					</msg:EpisodicMetricReport>
				</hm:HistoricReport>
			</hm:ChangeSequence>
		</hm:ChangeSequenceReport>
	</s12:Body>
</s12:Envelope>
